import telebot

# Телеграм бот объектини инициализациялау
bot = telebot.TeleBot("6931462175:AAFLw1D5ObmU9WQlIXfestQkgFKY4ITNf8c")

# Кино маълумотлари рўйхати
movies = {
    "1.Терминатор": {
        "жанр": "фантастика, боевик жылы:1984 ",
        "рейтинг": 8.0,
        "жылы":"2004",
    },
    "2.Титаник": {
        "жанр": "драма,мелодрама,тарих,триллер жылы:1997",
        "рейтинг": 9.3,
    },
    "3.Сәлем Европа":{
        "жанр": "драма, криминал жылы:2024",
        "рейтинг": 9.0,
    },
    "4.Фортуна Операция":{
        "жанр":"Комерия, Боевик жылы:2018",
        "рейтинг":8.3,
    },
    "5.Троя":{
        "жанр":"История, Боевик жылы:2012",
        "рейтинг":8.7,
    },
    "6.127 Сағат":{
        "жанр":"Шытырман жылы:2015",
        "рейтинг":7.8,
    },
    "7.Жоқ демейтін жан":{
        "жанр":"Романтикалық жылы:2004",
        "рейтинг":7.7,
    },
    "8.Я-Легенда":{
        "жанр":"Ужасы,Фантастика жылы:2020",
        "рейтинг":8.5,
    },
    "9.Кинг Конг":{
        "жанр":"Шытырман, Фантастика жылы:2017",
        "рейтинг":7.6,
    },
    "10.Өкініш ":{
        "жанр":"Махаббат оқиғасы жылы:2016",
        "рейтинг":9.9,
    },
    "11.Бітпейтін той":{
        "жанр":"Комидия жылы:2023",
        "рейтинг":8.6,
    },
    "12.Разбой":{
        "жанр":"Триллер, Боевик жылы:2023",
        "рейтинг":7.4,
    },
    "13.Ессіз ғашық":{
        "жанр":"Комидия, Романтика жылы:2023",
        "рейтинг":8.7,
    },
    "14.Супер отбасы":{
        "жанр":"Шытырман жылы:2004",
        "рейтинг":9.4,
    },
    "15.Мұз дәуірі":{
        "жанр":"Шытырман, Отбасылық жылы:2012",
        "рейтинг":7.6,
    },

   
 }

# /start командасини қабул қилиш функцияси
@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.reply_to(message, "Салем! Кино тізімін көру  /movies командасы бас")

# /movies командасини қабул қилиш функцияси
@bot.message_handler(commands=['movies'])
def send_movies(message):
    movie_list = "Кино тізімі:\n"
    for movie in movies:
         movie_list += f"{movie} - жанр:{movies[movie]['жанр']}, рейтинги: {movies[movie]['рейтинг']}\n"

    bot.send_message(message.chat.id, movie_list)
# Телеграм ботни ишга туширамиз
bot.polling()
